Revit 2027 API
DockPosition Enumeration
 Which part of the Revit application frame the pane should dock to.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DockPosition
Public Enumeration DockPosition
public enum class DockPosition
type DockPosition
Members
Member name | Value | Description
Bottom | 59,422
Floating | 59,423
Left | 59,420
Right | 59,421
Tabbed | 59,424
Top | 59,419
See Also
Reference
Autodesk.Revit.UI Namespace